{
  "contactInfo": {
    "name": "Jeff McCloud",
    "addressLines": [
      "92-1210 Makakilo Drive #1",
      "Kapolei, HI 96707"
    ],
    "phone": "808-753-4415",
    "email": "mccloud.jeff@gmail.com",
    "photo": "/assets/images/profile-img.jpg"
  },
  "summary": [
    "A full stack software engineer with 20 years of professional experience in many programming languages, frameworks, and environments.",
    "Expert in translating business requirements into robust technical solutions that are delivered on time.",
    "11 years working remotely as both a solo full stack developer as well as a member of a geographically distributed Agile team.",
    "Currently seeking a position working with the latest JavaScript web, mobile, and server technologies including React/Redux/GraphQL, Angular, Node.js, Express, Redis, MongoDB, PostgreSQL/MySQL, et al."
  ],
  "techExperience": [
    {
      "icon": "code",
      "title": "Languages and Frameworks",
      "subtitle": null,
      "text": "Fluent in modern JavaScript (ES6/7, Babel, JSX, TypeScript, Flow), C#, C++, Java, Python and most common markup languages and data exchange formats (HTML5, CSS, JavaScript, AJAX, WebSockets, JSON, REST, GraphQL, XML, XSLT, SOAP, RSS, Oauth, JWT, OData)"
    },
    {
      "icon": "hand-o-up",
      "title": "UI / UX",
      "subtitle": null,
      "text": "Front end development with most modern, popular JavaScript frameworks and tooling: React, Redux, GraphQL, Relay, Angular, Preact, Inferno, Ember, Elm, jQuery, jQuery UI, Bootstrap, Material Design, Kendo UI, Backbone.js, ExtJS, dojo, Node.js, Express, Vert.x, Gulp, Grunt, Bower, Babel, Webpack, Browserify, LESS, SASS, Jade, Jest, Mocha, Chai, Enzyme, and many more"
    },
    {
      "icon": "server",
      "title": "Server",
      "subtitle": null,
      "text": "Node.js, Express, NGINX, Apache, IIS, Kestrel, ASP.NET MVC and Web API, WCF, REST, GraphQL, Vert.x, ActiveMQ"
    },
    {
      "icon": "database",
      "title": "Databases and Storage",
      "subtitle": null,
      "text": "PostgreSQL, MySQL, MS SQL Server, Oracle, and NoSQL: MongoDB, Redis, CouchDB. ORM using Sequelize, Bookshelf.js, Entity Framework (.NET), GraphQL, graffiti, mongoose"
    },
    {
      "icon": "map-marker",
      "title": "Geospatial",
      "subtitle": null,
      "text": "ArcGIS Server 9.3-10.3.x, OpenLayers 3, Cesium, Leaflet, Google Maps API, Bing Maps API, Turf.js, OpenGeo Suite (PostGIS, GeoServer, QGIS), MySQL w/ Spatial Extensions, Oracle Spatial, SQL Server Spatial Data"
    },
    {
      "icon": "gears",
      "title": "Build and SDLC",
      "subtitle": null,
      "text": "Continuous Integration using TeamCity, CruiseControl, Jenkins, and Team Foundation Server. Source Code Control using Git, Subversion (SVN), Team Foundation Server. Cloud deployment to Amazon AWS, Microsoft Azure, Heroku."
    }
  ],
  "workExperience": [
    {
      "icon": "/assets/images/logo.hmsa.png",
      "employer": "Hawaii Medical Service Association - Honolulu, HI",
      "url": "https://hmsa.com/",
      "position": "Senior Software Engineer",
      "dates": "Aug 2016 to Present (Contractor)",
      "text": "Brought on board to help meet increasing development demands of company's public faciing website, hmsa.com. Developed new modules and refactored others to cohere with changes introduced by the Affordable Care Act. Refactored dozens of web pages and controls to meet Section 508 web accessibility standards. Helped develop new web module for healthcare providers. Lead effort to provide unit testing and code coverage across all C# and JavaScript code. Helped develop automated testing procedures using Selenium. Helped prepare transition of build process and testing environments to Microsoft Azure.",
      "keywords": "Tech: .NET, C#, MVC, WCF, Web Api, Entity Framework, Unity Framework, MSTest, Moq, Selenium, Bootstrap, AJAX, jQuery, Grunt, LESS, Apache Lucene, Team Foundation Server (TFS), SQL Server, Azure"
    },
    {
      "icon": "/assets/images/logo.corona.png",
      "employer": "Corona Environmental Consulting LLC - Rockland, MA (100% Remote)",
      "url": "http://www.coronaenv.com/",
      "position": "Senior Software Engineer",
      "dates": "Nov 2014 to May 2016",
      "text": "Hired as the company’s first engineer to help build the Software Development group at a burgeoning startup company in the water treatment and analysis industry. Developed early prototypes that helped secure $4 million in funding and a partnership with American Water, the nation’s largest publicly traded water and wastewater utility company. Helped create company’s flagship product Watersuite; a suite of web based GIS applications and real-time microservices using React, AngularJS, Node.js, Vert.x, ActiveMQ, and PostgreSQL. User interfaces were built using React and AngularJS focusing on responsive design, high performance, and customer usability. Developed a WebSocket based transport layer and data store to provide an ultra smooth user experience to our mapping applications. Created a set of NPM libraries and Yeoman generators that allowed other developers to create full stack geospatially aware web applications very quickly. Stood up Continuous Integration and Bug Tracking software for the development team. Worked to promote and ensure a proper Agile development process was to be followed on newly formed projects. Performed technical interviews and helped with onboarding of new hires",
      "keywords": "Tech: Node.js, Vert.x, JavaScript, ES6, TypeScript, C#, .NET, AngularJS, ReactJS, Redux, OpenLayers 3, Cesium, ArcGIS, PostgreSQL, PostGIS, Redis, MongoDB, Turf.js, GraphQL, Relay, Socket.IO, ActiveMQ, Material UI, Bootstrap, Kendo UI, jQuery, dojo, d3, Gulp, Babel, Webpack, Yeoman, SASS, LESS, YouTrack, TeamCity, GitHub, JIRA, Amazon Web Services"
    },
    {
      "icon": "/assets/images/logo.vsolvit.png",
      "employer": "VSolvit LLC - Ventura, CA (100% Remote)",
      "url": "http://www.vsolvit.com/",
      "position": "Senior Software Engineer",
      "dates": "Apr 2013 to Nov 2014",
      "text": "Created a reusable and extensible Javascript UI component framework, based on the ArcGIS JavaScript API, Kendo UI, and Bootstrap. This framework would serve as the foundation of several applications at VSolvit going forward, and allow the company to stand up cross browser JavaScript/HTML5 GIS solutions very quickly. Implemented this framework as part of several community projects and prototypes in the Health and Environmental industries. Contributed to or oversaw development of multiple ASP.NET/MVC, AngularJS, HTML5/JavaScript, and mobile web applications in the GIS space for the U.S. Navy (DoD), U.S. Department of Housing and Urban Development (HUD), and U.S. Department of Agriculture (USDA). Leveraged my unique experience across several projects with the Federal government, particularly with regard to implementing software development and configuration management life cycles that work well within these often more rigid environments. Provided input and direction on all aspects of the Software Development Life Cycle, including peer code review, software design best practices, Source Code Control, Release Management, Configuration Management, and Continuous Integration. Played an integral role in the company’s successful effort to become CMMI certified. Performed technical interviews and helped with onboarding of new hires.",
      "keywords": "Tech: C#, .NET, ASP.NET, MVC, Web API, LINQ, Entity Framework, SQL Server, Oracle, ArcGIS, Bootstrap, JavaScript, Kendo UI, jQuery, dojo, AngularJS, Node.js, Grunt, Gulp, Bower, YouTrack, TeamCity, GitHub, Oracle, SQL Server, Github, Team Foundation Server, Amazon Web Services"
    },
    {
      "icon": "/assets/images/logo.gisinc.png",
      "employer": "Geographic Information Services, Inc - Birmingham, AL (100% Remote)",
      "url": "http://gisinc.com/",
      "position": "Senior GIS Developer",
      "dates": "Feb 2009 to Apr 2013",
      "text": "Converted from contractor to full time employee when GIS, Inc. was awarded the contract for the project I was working on with NAVFAC, below. Upon joining the company, I created a new robust framework in .NET 3.5, forming the architectural backbone of all modules in the Navy's large enterprise GIS solution named GeoReadiness; an ArcGIS-based mapping application used to manage resources and facilities at naval bases worldwide. With that framework, we were able to provide the Navy with over a dozen distinct applications, much faster and more reliably than they had experienced in the past. During that time, I also developed GIS Inc's Source Code Control and Continuous Integration strategies, and helped form a more formal Agile development process to provide for our fast growing team. In 2012, I designed a new framework in .NET 4.5. That newer, lighter weight framework would similarly form the basis for many future Navy projects over the next few years. Granted Secret level security clearance with DoD.",
      "keywords": "Tech: .NET 3.5-4.5, ASP.NET, C#, SQL Server, Oracle, REST, SOAP, ArcGIS Server, ArcGIS Desktop Extensions, ArcGIS API for JavaScript, Silverlight, and Flex, JavaScript, HTML, CSS, SVN, Git, OnTime"
    },
    {
      "icon": "/assets/images/logo.navfac.png",
      "employer": "U.S. Navy (NAVFAC) - Pearl Harbor, HI (75% Remote)",
      "url": "http://www.navfac.navy.mil/",
      "position": "Senior Software Developer",
      "dates": "May 2004 to Feb 2009 (Contractor)",
      "text": "Worked as a contractor on major GIS project for Naval Facilities Engineering Command (NAVFAC) from 2004 to 2009. Same project spanned multiple employers, both full time and part time. Originally brought on in 2004 as a contractor to act as a .NET expert and mentor to a small development team who were transitioning development from Borland Delphi to .NET. In this capacity, I developed several reusable components and web server controls in C# to help kick start and expedite their application development, as well as to serve as .NET training modules for new hires. Developed large suite of GIS web applications name RSIMS (Regional Shore Installation Management System) using ASP.NET and ArcGIS. Granted Secret level security clearance with DoD.",
      "keywords": "Tech: .NET 2.0-3.5, ASP.NET, C#, SQL Server, Oracle, REST, SOAP, ArcGIS, JavaScript, HTML, CSS, Visual SourceSafe"
    },
    {
      "icon": "/assets/images/logo.lpl.png",
      "employer": "LPL Financial Services – San Diego, CA (100% Remote, beginning 2004)",
      "url": "https://lplfinancial.lpl.com",
      "position": "Senior Software Developer",
      "dates": "Aug 2001 to Oct 2012 (Contractor)",
      "text": "Developed key portions of LPL’s web-based financial investment and trading software suite, BranchNet; including modules responsible for Account and Portfolio management, as well as an enhanced security model. Developed multi-tiered web applications starting with traditional ASP/COM+ and eventually migrating to .NET in 2002. Data on SQL Server and 3rd party mainframes was managed by reusable COM components written in C++ and by .NET assemblies written in C#. Championed the early use of XML/XSLT and XMLHTTP/AJAX, to create more robust web forms and reports. Spearheaded the shift in development philosophy at LPL toward reusable component design and a layered application framework. Played critical role in the architectural design of LPL’s initial .NET application framework - the foundation upon which future product development would be based. Would often initiate efforts to identify and fix memory leaks and un-optimized code in legacy components, resulting in an improvement in performance, memory usage, and stability; something that was not previously possible in some older yet critical server side components. In the later years, worked primarily as a web application and services developer using .NET 3.5, AJAX, and .NET remoting. Considered by my peers to be an effective problem solver and a helpful resource regarding many aspects of various .NET technologies.",
      "keywords": "Tech: .NET 1.1-3.5, ASP.NET, C#, C++, COM, DCOM, .NET Remoting, WebForms, AJAX, SQL Server, Oracle, COM, DCOM, C++, Visual SourceSafe. StarTeam"
    },
    {
      "icon": null,
      "employer": "Multiple – San Diego, CA",
      "position": "Software Developer",
      "dates": "Oct 1995 to Aug 2001",
      "text": "Worked as a software developer and architect for variety of companies in software and other industries. Most noteworthy position was as Software Engineer IV at a short-lived startup formed by Microsoft and Qualcomm known as Wireless Knowledge back in 1999-2001, where I helped develop Microsoft's early attempts to get into the nascent mobile market - Microsoft Mobile Information Server and Outlook Mobile Access. Additional detail on this older employment history has been left off for brevity, but is available upon request.",
      "keywords": "Tech: C++, VB, C#, SQL Server, Oracle"
    }
  ],
  "education": [
    {
      "employer": "Microsoft Certified Professional Developer (MCPD)",
      "dates": "Expired 2014",
      "text": "Received MCPD certification in the Microsoft .NET Framework (Exams 70-536, 70-562, and 70-564 - Transcript available upon request)"
    },
    {
      "employer": "Secret Clearance with U.S. DoD",
      "dates": "Multiple 2004-2014",
      "text": "Received Secret level clearance on multiple projects while working for the United States Navy. Eligible to re-obtain this clearance at any time."
    }
  ],
  "social": [
    {
      "url": "http://stackoverflow.com/users/6901631/jeff-mccloud",
      "icon": "stack-overflow",
      "title": "Stack Overflow",
      "subtitle": null,
      "text": "I've become a fairly active contributing member recently, where I enjoy submitting answers about React, Redux, Material UI, and JavaScript."
    },
    {
      "url": "https://github.com/mccloud-jeff",
      "icon": "github",
      "title": "Github",
      "subtitle": null,
      "text": "I only have a few personal code repositories up here now, but I intend to start contributing much more as I get over my perfectionism :-/ A project I'm excited about that I hope will gain traction will be \"fungi-js\" - a fresh approach to GIS web applications using modern JavaScript and principals of Functional Programming."
    }
  ]
}
